app/controllers/events_controller.rb

	def index
		@events = Event.page(params[:page]).per(5)
---
SELECT  "events".* FROM "events" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "events"

	def create
		@event = Event.new(event_params)
  		if @event.save
---
INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jack"], ["description", "ddd"], ["created_at", "2015-02-15 14:14:06.930488"], ["updated_at", "2015-02-15 14:14:06.930488"]]

	def update
		if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "aaa"], ["updated_at", "2015-02-15 23:02:37.098164"], ["id", 4]]